2015-11-11/diversity/diversity.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>diversity</title>
<!-- 2015-11-11 Qua 16:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Vitor Capela" />
</head>
<body>
<div id="content">
<h1 class="title">diversity</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Diversidade e a área de tecnologia</a>
<ul>
<li><a href="#sec-1-1">1.1. Quem é o desenvolvedor de software padrão?</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Homem</a></li>
<li><a href="#sec-1-1-2">1.1.2. Branco</a></li>
<li><a href="#sec-1-1-3">1.1.3. Entre 20 e 35 anos</a></li>
<li><a href="#sec-1-1-4">1.1.4. Não-casado</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Do que gosta o desenvolvedor de software padrão?</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Filmes, livros e séries de fantasia, heróis e ficção científica</a></li>
<li><a href="#sec-1-2-2">1.2.2. Jogos eletrônicos</a></li>
<li><a href="#sec-1-2-3">1.2.3. Puzzles</a></li>
<li><a href="#sec-1-2-4">1.2.4. Matemática</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Quanto da população de encaixa nessa descrição?</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Eu nunca me senti descrito por essas características. Não tenho muito ardor por games (maneiro normal, só, e admiração técnica), não gosto de puzzles, não curto esses filmes (com raríssimas exceções) e tenho uma relação de admiração com a Matemática, mas não me considero uma pessoa definida pela relação com ela. Pelos meus gostos e as pessoas que conhecia, achava que não era pra mim.</a></li>
<li><a href="#sec-1-3-2">1.3.2. Quantos desenvolvedores se encaixam PLENAMENTE nessa descrição?</a></li>
<li><a href="#sec-1-3-3">1.3.3. Com quantas mulheres atuando como desenvolvedoras vocês já trabalharam?</a></li>
<li><a href="#sec-1-3-4">1.3.4. Com quantos negros atuando como desenvolvedores vocês já trabalharam?</a></li>
<li><a href="#sec-1-3-5">1.3.5. Com quantas mulheres negras atuando como desenvolvedoras vocês já trabalharam?</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. A monocultura no desenvolvimento de software</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. "Queremos alguém que se encaixe na equipe/que tenha o espírito da equipe/que compre a cultura da equipe"</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. As mulheres no desenvolvimento de software</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. A visão da mulher padrão</a></li>
<li><a href="#sec-1-5-2">1.5.2. Fato: meninas têm desempenho melhor que os meninos na escola em absolutamente todas as matérias até por volta da oitava série. O que acontece nesse momento da vida delas pra que haja uma disparidade?</a></li>
<li><a href="#sec-1-5-3">1.5.3. Os espaços para mulheres acabam sendo aqueles que se beneficiam dessas qualidades supostamente femininas: análise e levantamento de requisitos, QA, suporte</a></li>
<li><a href="#sec-1-5-4">1.5.4. Outro fato: mulheres ganham, no geral, 75-80% do salário de um homem executando o mesmo trabalho. Se for negra, pode ganhar de 50-60%.</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6. Criatividade e diversidade</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1. Vivências diferentes</a></li>
</ul>
</li>
<li><a href="#sec-1-7">1.7. Preparando uma sociedade diversa</a>
<ul>
<li><a href="#sec-1-7-1">1.7.1. Desafios</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Diversidade e a área de tecnologia</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Quem é o desenvolvedor de software padrão?</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Homem</h4>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Branco</h4>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Entre 20 e 35 anos</h4>
</div>
<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> Não-casado</h4>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Do que gosta o desenvolvedor de software padrão?</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Filmes, livros e séries de fantasia, heróis e ficção científica</h4>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Jogos eletrônicos</h4>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Puzzles</h4>
</div>
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Matemática</h4>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Quanto da população de encaixa nessa descrição?</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Eu nunca me senti descrito por essas características. Não tenho muito ardor por games (maneiro normal, só, e admiração técnica), não gosto de puzzles, não curto esses filmes (com raríssimas exceções) e tenho uma relação de admiração com a Matemática, mas não me considero uma pessoa definida pela relação com ela. Pelos meus gostos e as pessoas que conhecia, achava que não era pra mim.</h4>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Quantos desenvolvedores se encaixam PLENAMENTE nessa descrição?</h4>
</div>
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Com quantas mulheres atuando como desenvolvedoras vocês já trabalharam?</h4>
</div>
<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> Com quantos negros atuando como desenvolvedores vocês já trabalharam?</h4>
</div>
<div id="outline-container-sec-1-3-5" class="outline-4">
<h4 id="sec-1-3-5"><span class="section-number-4">1.3.5</span> Com quantas mulheres negras atuando como desenvolvedoras vocês já trabalharam?</h4>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> A monocultura no desenvolvimento de software</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> "Queremos alguém que se encaixe na equipe/que tenha o espírito da equipe/que compre a cultura da equipe"</h4>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> As mulheres no desenvolvimento de software</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> A visão da mulher padrão</h4>
<div class="outline-text-4" id="text-1-5-1">
</div><ol class="org-ol"><li><a id="sec-1-5-1-1" name="sec-1-5-1-1"></a>Soft/people skills<br  /></li>
<li><a id="sec-1-5-1-2" name="sec-1-5-1-2"></a>Mais emocional que racional (mesmo que isso fosse verdade absoluta, carrega um juízo de valor, em que a emoção é inferior à razão)<br  /></li>
<li><a id="sec-1-5-1-3" name="sec-1-5-1-3"></a>Mais afeita a humanas que exatas<br  /></li>
<li><a id="sec-1-5-1-4" name="sec-1-5-1-4"></a>Detalhistas<br  /></li></ol>
</div>
<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> Fato: meninas têm desempenho melhor que os meninos na escola em absolutamente todas as matérias até por volta da oitava série<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>. O que acontece nesse momento da vida delas pra que haja uma disparidade?</h4>
</div>
<div id="outline-container-sec-1-5-3" class="outline-4">
<h4 id="sec-1-5-3"><span class="section-number-4">1.5.3</span> Os espaços para mulheres acabam sendo aqueles que se beneficiam dessas qualidades supostamente femininas: análise e levantamento de requisitos, QA, suporte</h4>
</div>
<div id="outline-container-sec-1-5-4" class="outline-4">
<h4 id="sec-1-5-4"><span class="section-number-4">1.5.4</span> Outro fato: mulheres ganham, no geral, 75-80% do salário de um homem executando o mesmo trabalho. Se for negra, pode ganhar de 50-60%.</h4>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Criatividade e diversidade</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> Vivências diferentes</h4>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Preparando uma sociedade diversa</h3>
<div class="outline-text-3" id="text-1-7">
</div><div id="outline-container-sec-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> Desafios</h4>
<div class="outline-text-4" id="text-1-7-1">
</div><ol class="org-ol"><li><a id="sec-1-7-1-1" name="sec-1-7-1-1"></a>Cultura familiar<br  /></li>
<li><a id="sec-1-7-1-2" name="sec-1-7-1-2"></a>Sistema Educacional<br  /></li>
<li><a id="sec-1-7-1-3" name="sec-1-7-1-3"></a>Capitalismo<br  /><div class="outline-text-5" id="text-1-7-1-3">
</div>
</li></ol>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
“Gender Differences in Scholastic Achievement: A Meta-Analysis,” Daniel Voyer, PhD, and Susan D. Voyer, MASc, University of New Brunswick, Psychological Bulletin, online April 28, 2014.
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Vitor Capela</p>
<p class="date">Created: 2015-11-11 Qua 16:57</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
